package ru.plastinin.memo_linker_bot.constants;


public class MessageConstants {

    public final static String WELCOME_MESSAGE = """
            📎 📝 🗂 📂 📋 📁 📄 📑 🏷 💾 🚀 🌏 🔎 🏷️ ❓
            
            <b>@%s, добро пожаловать в бот "Хранитель ссылок"!</b>
            
            Здесь вы сможете сохранять полезные ссылки
            
            Команды:
            🚀 /start - Начать работу с ботом
            💾 /save [ссылка] [описание] [#тег #тег] - Сохранить ссылку
            📋 /list - Показать все сохраненные ссылки
            🏷️ /tags - Показать облако тегов
            🔎 /find [ключевое слово(а)] [#тег #тег] - Поиск ссылок
            ❓ /help -  Справка
            
            Вы зарегистрированы в боте %s
            
            """;

    public final static String MESSAGE_ERROR_NO_URL_TO_SAVE = """
            📝 Для сохранения ссылки воспользуйтесь командой:
            /save [ссылка] [описание] [#тег #тег]
            
            <b>Например</b>
            <i>/save https://example.com/article</i>
            или
            <i>/save https://example.com/article "Описание" #tag #tag1</i>
            
            """;

    public final static String MESSAGE_ERROR_FIND_LINKS = """
            🔎 Для поиска ссылки воспользуйтесь командой:
            
            /find [ключевые слова] [#тег #тег]
            
            <b>Например:</b>
            <i>/find spring boot</i>
            или
            <i>/find #java #spring #git</i>
            
            """;

    public final static String MESSAGE_NO_DATA_FOUND = """
            🕵️‍♂️ По вашему запросу данные не найдены!
            
            🔎 Для поиска ссылки воспользуйтесь командой:
            /find [ключевые слова] [#тег #тег]
            
            <b>Например:</b>
            <i>/find spring boot</i>
            или
            <i>/find #java #spring #boot</i>
            
            """;

    public static String EMPTY_BASE = """
            🏷️ У вас пока нет сохраненных ссылок. Добавьте первую ссылку с тегами!
            
            📝 Для сохранения ссылки воспользуйтесь командой:
            /save [ссылка] [описание] [#тег #тег]
            
            <b>Например</b>
            <i>/save https://example.com/article</i>
            или
            <i>/save https://example.com/article "Описание" #tag #tag1</i>
            
            """;

    public final static String MESSAGE_ERROR_DATA_DUPLICATION = """
             ❌ Не удалось сохранить.
            
             Эта ссылка уже хранится в базе данных.
             Вы добавляли ее %s
            
            """;


    public final static String MESSAGE_ERROR_SAVE = """
            ❌ Не удалось сохранить ссылку.
            ↩️ Воспользуйтесь командой:
            /save [ссылка] [описание] [#тег #тег]
            
            <b>Например:</b>
            <i>/save https://example.com/article "Описание" #programming #java #github</i>
            
            """;

    public final static String MESSAGE_OK_SAVE = """
            ✅ <b>Сохранено</b>: "%s"
            
            📝 %s
            
            🏷️ %s
            
            """;

    public final static String HELP_MESSAGE = """
            <b>📚❓ Справка по командам:</b>
            
            🚀 /start - Начать работу с ботом
            💾 /save [ссылка] [описание] [#тег #тег] - Сохранить ссылку
            📋 /list - Показать все сохраненные ссылки
            🏷️ /tags - Показать облако тегов
            🔎 /find [ключевое слово(а)] [#тег #тег] - Поиск ссылок
            ❓ /help -  Справка
            
            <b>Примеры:</b>
            <i>/save https://example.com "Полезная статья" #программирование #java</i>
            <i>/find spring boot #java #linux</i>
            
            """;
}
